import pandas as pd

data = {
    'Имя': ['Аня','Боря','Вика','Дима','Ева','Женя','Зоя','Игорь','Катя','Лёша'],
    'Математика': [5,4,3,5,4,2,3,4,5,3],
    'Русский язык': [4,5,5,3,4,4,5,3,4,5],
    'Английский': [3,4,4,5,2,3,4,5,3,4],
    'Физика': [5,4,3,4,5,2,3,4,4,5],
    'Информатика': [4,3,5,5,4,4,3,4,5,2]
}
df = pd.DataFrame(data)

print("Первые строки таблицы:")
print(df.head(),end="\n\n")

print("Средние оценки по предметам:")
print(df[['Математика','Русский язык','Английский','Физика','Информатика']].mean(),end="\n\n")

print("Медианные оценки по предметам:")
print(df[['Математика','Русский язык','Английский','Физика','Информатика']].median(),end="\n\n")

Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR_math = Q3_math - Q1_math

print(f"Q1 по математике: {Q1_math}")
print(f"Q3 по математике: {Q3_math}")
print(f"IQR по математике: {IQR_math}\n")

print("Стандартное отклонение по предметам:")
print(df[['Математика','Русский язык','Английский','Физика','Информатика']].std())